[
  {
    "year": 2015,
    "uri": "https://2015.elifesciences.org",
    "title": "The eLife Sciences 2015 Annual Report",
    "impact_statement": "The centre of the stage at eLife in 2015 was occupied by a new human ancestor – <em>Homo naledi</em> – discovered by scientists in an extraordinary find in South Africa and published in eLife in two stunning papers in September. That these scientists chose to publish such ground-breaking findings in eLife is testament both to the journal’s growing significance, and to the steady cultural shift towards greater transparency and collaboration in science, which lie at the heart of eLife’s mission.",
    "image": "annual_reports/annual_report_2015.png"
  },
  {
    "year": 2014,
    "uri": "https://2014.elifesciences.org",
    "title": "The eLife Sciences 2014 Annual Report",
    "impact_statement": "Having published almost 800 research articles by the close of 2014, in this report eLife is showcasing its achievements in attracting growing numbers of submissions, publishing a broad swath of high-quality research swiftly and constructively, supporting transparency and reproducibility, as well as the careers of early-career researchers, and exploring new publication formats.",
    "image": "annual_reports/annual_report_2014.png"
  },
  {
    "year": 2013,
    "uri": "https://2013.elifesciences.org",
    "title": "The eLife Sciences 2013 Annual Report",
    "impact_statement": "In 2013, eLife made clear its intentions to address some of the critical issues facing science today . The 2013 Annual Report emphasises areas where eLife made significant progress, including challenging the incentive system through the Declaration on Research Assessment and the introduction of eLife Lens, an innovative new article - viewing platform . The Report also points towards how the unique initiative will continue to expand on successes in technology innovation and challenge the status quo.",
    "image": "annual_reports/annual_report_2013.png"
  },
  {
    "year": 2012,
    "uri": "https://2012.elifesciences.org",
    "title": "The eLife Sciences 2012 Annual Report",
    "impact_statement": "The 2012 Annual Report highlights key achievements from the year that saw eLife publish its first research articles . The Report focuses on eLife’s commitment to the highest standards in open - access publishing, the innovative editorial process and the eLife media policy, inspired by one of eLife’s earliest authors making her manuscript openly available ahead of publication.",
    "image": "annual_reports/annual_report_2012.png"
  }
]
